//ЗАДАНИЕ 3
//Доработайте программу из задания 1, используя ваш метод из задания 2.

//При запуске программа должна:

//Показать, сколько весит папка до очистки. Использовать метод из задания 2. 
//Выполнить очистку.
//Показать сколько файлов удалено и сколько места освобождено.
//Показать, сколько папка весит после очистки.

//Критерии оценивания
//0 баллов: задача решена неверно или отсутствует доступ к репозиторию.
//2 балла (хорошо): написан метод и код выполняет свою функцию.
//4 балла (отлично): предусмотрена обработка исключений и валидация пути.


